### Show the pandas version

In [2]:
import pandas as pd
pd.__version__

'1.1.5'

### Pandas dependencies

In [13]:
# pd.show_versions()

### Create en example DataFrame

In [18]:
# Creating a dataframe from a dictionary
df = pd.DataFrame({'col one': [100, 200], 'col two': [300, 400]})
df

   col one  col two
0      100      300
1      200      400

In [10]:
# Creating a big dataframe from random values
import numpy as np
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.289262,0.887068,0.566113,0.399159,0.105012,0.924714,0.021008,0.566005
1,0.628112,0.086061,0.719394,0.998873,0.641188,0.607673,0.916153,0.104653
2,0.179349,0.511824,0.614375,0.076396,0.888939,0.648682,0.007597,0.367706
3,0.675514,0.067787,0.601646,0.197398,0.007941,0.808876,0.381857,0.421627

In [11]:
# Creating a dataframe with columns names other than numbers. Here, alphabets from the list
pd.DataFrame(np.random.rand(4,8), columns = list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.901703,0.403060,0.247963,0.470466,0.654080,0.609618,0.285499,0.206664
1,0.237009,0.913521,0.974173,0.882956,0.816871,0.589706,0.262030,0.451689
2,0.535268,0.108052,0.646661,0.932960,0.587299,0.805647,0.467646,0.302077
3,0.047086,0.955162,0.206173,0.373536,0.577591,0.090499,0.853034,0.720798

### Rename columns

In [12]:
df

   col one  col two
0      100      300
1      200      400

In [19]:
# Renaming the column using dictionary method
# keys are the old names and values are new names
# With this, we can rename any column and any number of columns
df = df.rename({'col one': 'col_one', 'col two':'col_two'}, axis = 'columns')
df

   col_one  col_two
0      100      300
1      200      400

In [22]:
# reassigning or renaming all the columns irrespective of their old names
df.columns = ['col_one', 'col_two']

In [23]:
# Replace particular substring to other substring
df.columns = df.columns.str.replace(' ', '_')
df

   col_one  col_two
0      100      300
1      200      400

In [24]:
# Add prefix
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [25]:
# Add suffix
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

### Reverse the row order

In [27]:
dfr = pd.DataFrame(np.random.rand(10,8))
dfr

,0,1,2,3,4,5,6,7
0,0.648620,0.701631,0.361178,0.326093,0.721273,0.053686,0.757662,0.723144
1,0.411736,0.518666,0.935169,0.529580,0.007226,0.013108,0.604676,0.726580
2,0.345676,0.607968,0.041497,0.704728,0.917210,0.908236,0.526377,0.833262
3,0.063978,0.055681,0.619173,0.543745,0.272041,0.364778,0.114542,0.473359
4,0.104734,0.662841,0.679483,0.240006,0.187413,0.188863,0.458673,0.364380
5,0.894541,0.195981,0.284033,0.867668,0.118238,0.777134,0.101879,0.993144
6,0.837288,0.898994,0.387847,0.138368,0.624636,0.251683,0.141265,0.548748
7,0.680986,0.994033,0.590197,0.238885,0.764445,0.930905,0.698133,0.183104
8,0.169506,0.339775,0.940598,0.760861,0.234226,0.216849,0.489482,0.157432
9,0.250445,0.575110,0.727717,0.851257,0.933735,0.484265,0.699594,0.433437

In [28]:
# reverse the row order with index number preserved
dfr.loc[::-1].head()

,0,1,2,3,4,5,6,7
9,0.250445,0.575110,0.727717,0.851257,0.933735,0.484265,0.699594,0.433437
8,0.169506,0.339775,0.940598,0.760861,0.234226,0.216849,0.489482,0.157432
7,0.680986,0.994033,0.590197,0.238885,0.764445,0.930905,0.698133,0.183104
6,0.837288,0.898994,0.387847,0.138368,0.624636,0.251683,0.141265,0.548748
5,0.894541,0.195981,0.284033,0.867668,0.118238,0.777134,0.101879,0.993144

In [29]:
# Reverse the row order with reseting the index numbers and dop the old set of indices
dfr.loc[::-1].reset_index(drop=True)

,0,1,2,3,4,5,6,7
0,0.250445,0.575110,0.727717,0.851257,0.933735,0.484265,0.699594,0.433437
1,0.169506,0.339775,0.940598,0.760861,0.234226,0.216849,0.489482,0.157432
2,0.680986,0.994033,0.590197,0.238885,0.764445,0.930905,0.698133,0.183104
3,0.837288,0.898994,0.387847,0.138368,0.624636,0.251683,0.141265,0.548748
4,0.894541,0.195981,0.284033,0.867668,0.118238,0.777134,0.101879,0.993144
5,0.104734,0.662841,0.679483,0.240006,0.187413,0.188863,0.458673,0.364380
6,0.063978,0.055681,0.619173,0.543745,0.272041,0.364778,0.114542,0.473359
7,0.345676,0.607968,0.041497,0.704728,0.917210,0.908236,0.526377,0.833262
8,0.411736,0.518666,0.935169,0.529580,0.007226,0.013108,0.604676,0.726580
9,0.648620,0.701631,0.361178,0.326093,0.721273,0.053686,0.757662,0.723144

### Reverse column order

In [30]:
dfr.loc[:, ::-1]

,7,6,5,4,3,2,1,0
0,0.723144,0.757662,0.053686,0.721273,0.326093,0.361178,0.701631,0.648620
1,0.726580,0.604676,0.013108,0.007226,0.529580,0.935169,0.518666,0.411736
2,0.833262,0.526377,0.908236,0.917210,0.704728,0.041497,0.607968,0.345676
3,0.473359,0.114542,0.364778,0.272041,0.543745,0.619173,0.055681,0.063978
4,0.364380,0.458673,0.188863,0.187413,0.240006,0.679483,0.662841,0.104734
5,0.993144,0.101879,0.777134,0.118238,0.867668,0.284033,0.195981,0.894541
6,0.548748,0.141265,0.251683,0.624636,0.138368,0.387847,0.898994,0.837288
7,0.183104,0.698133,0.930905,0.764445,0.238885,0.590197,0.994033,0.680986
8,0.157432,0.489482,0.216849,0.234226,0.760861,0.940598,0.339775,0.169506
9,0.433437,0.699594,0.484265,0.933735,0.851257,0.727717,0.575110,0.250445

### Select columns by datatype

In [32]:
dfr.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
6    float64
7    float64
dtype: object

In [35]:
# selecting only object columns. Here none.
dfr.select_dtypes(include = 'object').head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [36]:
# selecting only numerical columns
dfr.select_dtypes(include = 'number').head()

,0,1,2,3,4,5,6,7
0,0.648620,0.701631,0.361178,0.326093,0.721273,0.053686,0.757662,0.723144
1,0.411736,0.518666,0.935169,0.529580,0.007226,0.013108,0.604676,0.726580
2,0.345676,0.607968,0.041497,0.704728,0.917210,0.908236,0.526377,0.833262
3,0.063978,0.055681,0.619173,0.543745,0.272041,0.364778,0.114542,0.473359
4,0.104734,0.662841,0.679483,0.240006,0.187413,0.188863,0.458673,0.364380

In [37]:
# We can also include multiple datatypes:
dfr.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

,0,1,2,3,4,5,6,7
0,0.648620,0.701631,0.361178,0.326093,0.721273,0.053686,0.757662,0.723144
1,0.411736,0.518666,0.935169,0.529580,0.007226,0.013108,0.604676,0.726580
2,0.345676,0.607968,0.041497,0.704728,0.917210,0.908236,0.526377,0.833262
3,0.063978,0.055681,0.619173,0.543745,0.272041,0.364778,0.114542,0.473359
4,0.104734,0.662841,0.679483,0.240006,0.187413,0.188863,0.458673,0.364380

In [38]:
# We can also exclude certain datatypes
dfr.select_dtypes(exclude='number').head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

### Convert strings to number

In [39]:
df = pd.DataFrame({'col_one': ['1.1', '2.2', '3.3'],
                  'col_two': ['4.4', '5.5', '6.6'],
                  'col_three': ['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [40]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [41]:
# it would convert the type of all those columns which have possibility to convert their type
# It would have given an error on the 3rd column as it contains a dash(-)
df.astype({'col_one': 'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [43]:
# Applying on a particular column
# Convert any invalid inputs into NaN values
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [45]:
# If we know that NaN values represents zero, then we can fill NaN values with zeros
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [46]:
# Instead of particular column, if we want to apply the method to the complete dataframe then we can use apply method
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [48]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

### Reduce dataframe size

In [53]:
# At the bottom of the output we can check how much size is getting occupied by the dataframe
df = pd.read_csv('http://bit.ly/drinksbycountry')
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [57]:
# If the files too large and we need only few columns so as to avoid memory error, the we can read particular columns only using usecols
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols = cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [58]:
small_drinks['continent']

0               Asia
1             Europe
2             Africa
3             Europe
4             Africa
           ...
188    South America
189             Asia
190             Asia
191           Africa
192           Africa
Name: continent, Length: 193, dtype: object

In [59]:
# By reading any column with the 'category' datatype, we further reduce the SIZE of the dataframe
# This time, the size will only be reduced when we have small number of categories relative to the number of floats
dtypes = {'continent' : 'category'}
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=dtypes)
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

### Build a DataFrame from multiple files (row-wise)

In [60]:
# We can read different .csv files with same column names into the dataframe, concat them and delete the original smaller dataframes.
# But this will be memory inefficient and will occupy lot of space

# SO, we can save the memory be concatinating them while reading itself
# We make a use of glob for this

In [61]:
#from glob import glob
#stock_files = sorted(glob('data/stocks*.csv'))
# stock_files

In [62]:
# concatinating with glob without rearranging the index. We get duplicate index values here
#pd.concat((pd.read_csv(file) for file in stock_files))

In [64]:
# concatinating with glob by reseting the index by ignoring it
#pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

### Build a DataFrame from multiple files (column-wise)

In [65]:
# We again make use of globs and this time we concatenate along the column axis
# pd.concat((pd.read_csv(file) for file in drink_files), axis='columns').head()

### Create a DataFrame from the clipboard

In [ ]:
#copy the tabular data, maybe from excel
# then
# df = pd.read_clipboard()
# df
# df.index

### Split a DataFrame into two random subsets

In [66]:
#For dataframes with uniques row indices
movies = pd.DataFrame(np.random.rand(14,8))

In [67]:
movies_1 = movies.sample(frac=0.75, random_state=1234) #75%data
movies_2 = movies.drop(movies_1.index) #except the above 75% data

In [70]:
movies_2

,0,1,2,3,4,5,6,7
3,0.492140,0.685341,0.105271,0.067212,0.250593,0.945600,0.597596,0.297543
4,0.160771,0.450033,0.070105,0.090258,0.598208,0.362539,0.552839,0.216564
5,0.817434,0.280540,0.430321,0.710895,0.583871,0.687804,0.027666,0.298047
6,0.009880,0.204278,0.559439,0.634970,0.603905,0.639808,0.814014,0.866520

In [ ]:
# We can see the indices of these dataframe like this
# movies_1.index.sort_values()

### Filter a Dataframe by multiple categories

In [ ]:
#Suppose for a movies dataset
#There is a column named genre
#movies.genre.unique()

In [ ]:
# We can get all those rows with the particular values for any columns in the following way
# movies[(movies.genre == 'Action') | 
#     (movies.genre == 'Drama') |
#     (movies.genre == 'Western')].head()

In [71]:
#more clearly we can wirte:
# movies[movies.genre.isin(['Action', 'Drama', 'Western'])].head()
# Also to avoid some rows with conditions, we do
# movies[~movies.genre.isin(['Action', 'Drama', 'Western'])].head()

### Filter a DataFrame by largest categories

In [72]:
#We want to select the data with 3 largest genres. Genres is a column which contains multiple genres
#counts = movies.genre.value_counts()
# counts()

In [73]:
#To delect 3 largest genres
# counts.nlargest(3)

#Here, couns.nlargest(3).index   represents the count of 3 largest genres with the help of which we can get all those rows with this genres

In [74]:
# To get the dataframe with top 3 genres in count
# movies[movies.genre.isin(counts.nlargest(3).index)].head()

### Handle missing values

In [ ]:
# ufo.head()

# ufo.dropna(thres=len(ufo)*0.9, axis='columns').head()

In [75]:
#To know how many NaN values are present inside the dataset
# ufo.isna().sum()

In [ ]:
# To know the % of missing values
# ufo.isna().mean()

In [ ]:
#To drop the column with any missing values
# ufo.dropna(axis='columns').head()

In [76]:
#To drop only those columns where 10% of values are missing
# ufo.dropna(thres=len(ufo)*0.9, axis='columns').head()

### Split a string into multiple columns

In [79]:
df = pd.DataFrame({'name': ['John Arthur Doe', 'Jane Ann Smith'],
                  'location': ['Los Angeles, CA', 'Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [84]:
#Split the column based on space character in the datavalue of that column
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [86]:
#Split the columns based on spaces and create new columns with the custom names inside the same dataframe
df[['first', 'middle', 'last']] = df.name.str.split(' ', expand=True)
df

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [87]:
#Here, we we wanted to save only city name, then
df['city'] = df.location.str.split(', ', expand=True)[0]
df

              name         location first  middle   last         city
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe  Los Angeles
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith   Washington

### Expand a Series of lists into a DataFrame

In [88]:
df = pd.DataFrame({'col_one': ['a', 'b', 'c'], 'col_two':[[10,40], [20, 50], [30, 60]]})
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [89]:
df_new = df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [90]:
#By using concat function, we can combine the original dataframe with the new dataframe
pd.concat([df, df_new], axis='columns')

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60

### Aggregate by multiple functions

In [92]:
#Dataframe contains orderid, quantiity, itemname, choic_description, item_price
# orders.head(10)

In [93]:
#summing based on particular item id
# orders[orders.order_id == 1].item_price.sum()

In [94]:
#Instead, we can do the same for all itemids, using groupby....
# orders.groupby('order_id').item_price.sum().head()

In [ ]:
# We can also calculate multiple properties such as sum, count, etc in a single go using agg method
# orders.groupby('order_id'.item_price.agg(['sum', 'count']).head()

### Combine the output of aggregation with a DataFrame

In [ ]:
#It returns small output size than the input size
# orders.groupby('order_id').item_price.sum().head()

In [96]:
#If we want to get same size as input size as to add the output as a column in the dataframe, we use transform function
# total_price = orders.groupby('order_id').item_price.transform('sum')
# orders['total_price'] = total_price

In [97]:
#from the above, we can easilt calculate the % of itemprice w.r.t total and add the result into the column
# orders['percent_of_total'] = orders.item_price / orders.total_price

### Select a slice of rows and columns and get the data summary

In [98]:
# titanic.head()

In [99]:
# To get some kind of data summary in the form of a dataframe
# titanic.describe()_

In [100]:
# from this summary, if we wish to get few rows only
# titanic.describe().loc['min':'max']

In [101]:
# To also select particular columns, we write:
# titanic.describe().loc['min':'max', 'Pclass':'Parch']

### Reshape a MultiIndexed Series | Groupby

In [102]:
#mean of a column called survive
# titanic.Survived.mean()

In [103]:
#mean of survival for male and female of column 'Sex' 
# titanic.groupby('Sex').Survived.mean()

In [104]:
# Similarly, mean of survival for two columns
# titanic.groupby(['Sex', 'Pclass']).Survived.mean()

In [106]:
# To store the above type of Series as a Dataframe, we use unstack
# titanic.groupby(['Sex', 'Pclass']).Survived.mean().unstack()

### Create a pivot table

In [107]:
#Kind of custom table of our own wish
#  titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean')

In [108]:
# To make a column and row total using margins=True
# titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean', margins=True)

### Convert continuous data into categorical data

In [109]:
#Getting the Age column of the dataframe titanic
#titanic.Age.head(10)

In [110]:
#Setting the range for a continuous column(i.e. Age) and getting them into the categorical labels
# After this, the data type become category
# pd.cut(titanic.Age, bins=[0, 18, 25, 99], labels=['child', 'young adult', 'adult']).head(10)

### Change display options (say, number of decimal places)

In [112]:
#in this example, it will work on float dataset
# pd.set_option('display.float_format', '{:.2f}'.format)
# titnaic.head()
# After this, float columns will have 2 decimal places without affect other columns

In [113]:
#To reset the changes made by set_option
# pd.reset_option('display.float_format')

### Style a DataFrame

In [115]:
# stocks
# We can change the dateformat
# We can add $ symbol infront of Close column's data-values tag
# Make big number like 1000000 into readble number string 1000,000

In [116]:
#  format_dict = {'Date': '{:%m/%d/%y}', 'Close':'${:,.2f}', 'Volumn':'{:,}'}

In [117]:
#We can add more styling
#Like: hide the index
#Highlight min close value and color it red
# Highlight max close value and highlight it with lightgreen

In [ ]:
# Close is the column name
# (stocks.style.format(format_dict)
# .hide_index()
# .highlight_min('Close', color='red')
# .highlight_max('Clsoe', color='lightgreen')
# )

In [118]:
# Another method to identify high and low values
# Volume is the column name
# (stocks.style.format(format_dict)
# .hide_index()
# .background_gradient(sunset='Volume', cmap='Blues')
# )

In [119]:
#shows %occupancy of the of the volumn columns in it's datavalues
# Also adds caption to the dataframe
# (stocks.style.format(format_dict)
# .hide_index()
# .bar('Volume', color='lightblue', align='zero')
# .set_caption('Stock Prices from October 2016')
# )

## Profile a Dataframe

In [122]:
# import pandas_profiling

In [123]:
# We can generate the dataframe's report (here titanic)
# pandas_profiling.ProfileReport(titanic)

In [125]:
# Outputs the interractive HTML report
# 1st section: Overview(like data describe and warnings as well)
# 2nd section : Variables (summary of each columns)
# 3rd section : Correlatons(heatmap)
# 4th section : shows the head of the dataset